{
    "navbar-tools": "Outils",
    "navbar-projects": "Projets",
    "navbar-mini-games": "Mini-Jeux",

    "span-look": "Voir",
    "coming-soon": "Bientôt disponible",

    "root-subtitle": "Je joue à des jeux. Beaucoup de jeux.",
    "root-swiper-card-projects": "Projets",
    "root-section-socials": "Mes réseaux sociaux :",

    "algodoo-title": "Là où les idées prennent forme,<br>sur une scène en 2D",
    "algodoo-subtitle": "Retrouvez mes scènes les plus populaires ici. <a href=\"http://www.algodoo.com/algobox/profile.php?id=51929\" target=\"_blank\"><span class=\"button algodoo\">Voir le profil</span></a>",
    "algodoo-span-series-title": "Séries",
    "algodoo-span-series-subtitle": "Toutes les séries de scènes.",
    "algodoo-span-games-title": "Jeux",
    "algodoo-span-games-subtitle": "Tous les jeux interactifs.",
    "algodoo-span-unmissables-title": "Les immanquables",
    "algodoo-span-unmissables-subtitle": "Toutes les scènes à voir absolument !",

    "navbar-portfolio-personal-projects": "Projets personnels",
    "navbar-portfolio-university-projects": "Projets universitaires",

    "portfolio-title": "Mon Portfolio",
    "portfolio-subtitle": "Bienvenue sur mon portfolio !<br>Vous trouverez ici mes projets personnels et universitaires que j'ai réalisés durant ma formation.<br><br>Si vous souhaitez retrouver ou télécharger les projets terminés, vous pouvez les retrouver dans <a href=\"/Projects\"><span class=\"button\">Projets</span></a>.",
    "portfolio-my-formation": "Ma formation ?",
    "portfolio-my-formation-desc": "Je suis en première année de BUT Informatique à l'IUT de Belfort.<br>J'ai commencé ma formation en septembre 2024 et j'y apprends de nombreux langages de programmation ainsi que des outils de développement.",
    "portfolio-which-languages": "Quels langages ?",
    "portfolio-which-languages-desc": "Principalement du Java et du Python, mais aussi du SQL, de l'HTML et du CSS.<br>Dans un but personnel, j'ai aussi appris le JavaScript.<br>J'ai également appris à utiliser des outils comme Git, Visual Studio Code et IntelliJ IDEA.",
    "portfolio-whats-next": "Et ensuite ?",
    "portfolio-whats-next-desc": "Le but final serait de devenir développeur dans le jeu vidéo.<br>La route est encore longue, mais je suis motivé et prêt à relever les défis !",

    "portfolio-university-projects-orbito-title": "Projet 1 : Création d'un jeu de plateau",
    "portfolio-university-projects-orbito-desc": "Ce projet a été créé dans le cadre de la SAÉ S2.01-02-06 : <br><ul><li>UE 1 : Réaliser un développement d'application</li><li>UE 2 : Optimiser des applications</li><li>UE 6 : Collaborer au sein d'une équipe informatique</li></ul>Inspiré du jeu Orbito, les joueurs doivent placer des billes sur le plateau dans le but de les aligner pour gagner.",
    "portfolio-university-projects-techmobile-title": "Projet 2 : Développement d'un site de e-commerce",
    "portfolio-university-projects-techmobile-desc": "Ce projet a été créé dans le cadre de la SAÉ S2.03-04-05 : <br><ul><li>UE 3 : Administrer des systèmes informatiques communiquants complexes</li><li>UE 4 : Gérer des données de l'information</li><li>UE 5 : Conduire un projet</li></ul>Le but de ce projet était de créer un site de e-commerce pour une entreprise fictive, TechMobile, spécialisée dans la vente de téléphones mobiles.",

    "orbito-figcaption": "Figure 1 : Utilisation de l'éditeur IntelliJ IDEA pour créer un jeu de plateau",
    "orbito-desc-1": "La Figure 1 est une capture d’écran de l’environnement de développement IntelliJ IDEA, utilisé ici pour programmer une application en Java. Cette application, nommée Orbito++, a été développée dans le cadre d’un projet de groupe, avec pour objectif de concevoir un jeu de plateau à partir de la bibliothèque Java Boardifier, spécialisée dans la création de jeux en 2D.",
    "orbito-desc-2": "Sur la colonne à gauche, on peut voir la structure du projet. Cette structure suit le paradigme MVC, répartie en trois paquets (en rouge, la partie Contrôleur, en vert, la partie Modèle et en bleu, la partie Vue).",
    "orbito-desc-3": "La classe OrbitoStageModel, ouverte dans l'éditeur, illustre plusieurs savoirs. On y reconnaît l’usage du langage Java, avec des concepts comme l’héritage de classes (extends GameStageModel, entouré en magenta) et la manipulation d'objets publics et privés. Le code montre aussi la capacité à définir des méthodes d’accès et d'enregistrement (getters/setters), à instancier des objets, et à organiser la classe autour de ses attributs.",
    "orbito-desc-4": "Cette figure témoigne de la capacité à structurer proprement une application Java, en utilisant des dossiers structurés et nommés, permettant une mainenance plus facile du code. Elle illustre également la mise en œuvre d'une classe de modèle, essentielle pour la gestion des données et la logique métier dans une application MVC.",

    "projects-title": "Tous les projets de KGΛMΞX",
    "projects-subtitle": "Projets de code, de web ou d'autres, tout est présent ici ! <a href=\"/Portfolio\"><span class=\"button\">Ouvrir le portfolio</span></a>",
    "projects-what-is-it": "Qu'est-ce que c'est ?",
    "projects-what-is-it-desc": "Ce sont des projects personnels ou que j'ai récupéré dans le cadre de mon cursus universitaire.<br>Du Python au Java, en passant par HTML, j'ai appris de nombreux langages de programmation durant ma formation.<br>Tout cela donne à la fin des projets intéressants et amusants !",

    "tools-title": "Les Outils",
    "tools-button-save": "Sauvegarder"
}